### inthis notebook we cover datatype broadcasting technique

In [1]:
import pandas as pd
import numpy as np
print("imported successfully")

imported successfully

In [4]:
data={"string_col":['1','2','3','4','5'],
     "int_float":[1,3,2,2.2,3],
     "int_col":[4,4,64,43,34],
     "mising_col":[1,3,4,5,np.nan],
     "mixed_col":["a","-2",3,4,3],
     "price":["$1,500.00","$2,436.45","$9,58.99","$1,798.00","$5,456.25"]}
data

{'string_col': ['1', '2', '3', '4', '5'],
 'int_float': [1, 3, 2, 2.2, 3],
 'int_col': [4, 4, 64, 43, 34],
 'mising_col': [1, 3, 4, 5, nan],
 'mixed_col': ['a', '-2', 3, 4, 3],
 'price': ['$1,500.00', '$2,436.45', '$9,58.99', '$1,798.00', '$5,456.25']}

In [6]:
data=pd.DataFrame(data=data)
data
# creating dataframe using dictionary

  string_col  int_float  int_col  mising_col mixed_col      price
0          1        1.0        4         1.0         a  $1,500.00
1          2        3.0        4         3.0        -2  $2,436.45
2          3        2.0       64         4.0         3   $9,58.99
3          4        2.2       43         5.0         4  $1,798.00
4          5        3.0       34         NaN         3  $5,456.25

In [7]:
data.dtypes

string_col     object
int_float     float64
int_col         int64
mising_col    float64
mixed_col      object
price          object
dtype: object

In [6]:
# converting string to integer

data['string_col']=data['string_col'].astype(int)
data['string_col'].dtypes

dtype('int32')

In [8]:
#after converting integer, again we are trying to convert into float 
data['string_col']=data['string_col'].astype(float)
data['string_col'].dtypes

dtype('float64')

In [9]:
# now you can see we got it values in float
data["string_col"]

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: string_col, dtype: float64

### and now i will deal with the int_float column

In [7]:
data['int_float'].dtypes

dtype('float64')

In [8]:
data['int_float']

0    1.0
1    3.0
2    2.0
3    2.2
4    3.0
Name: int_float, dtype: float64

In [9]:
data['int_float']=data['int_float'].astype(int)
data['int_float'].dtypes

dtype('int32')

In [11]:
data['int_float']

0    1
1    3
2    2
3    2
4    3
Name: int_float, dtype: int32

In [7]:
data['int_float'].dtypes

dtype('int32')

In [6]:
data.head()
# int_float coverted into integer

  string_col  int_float  int_col  mising_col mixed_col      price
0          1          1        4         1.0         a  $1,500.00
1          2          3        4         3.0        -2  $2,436.45
2          3          2       64         4.0         3   $9,58.99
3          4          2       43         5.0         4  $1,798.00
4          5          3       34         NaN         3  $5,456.25

In [13]:
data.dtypes

string_col    float64
int_float       int32
int_col         int64
mising_col    float64
mixed_col      object
price          object
dtype: object


### int_float again reverse in float position

In [14]:
data['int_float']=data['int_float'].astype(float)
data['int_float'].dtypes

dtype('float64')

In [15]:
data.head()

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4         1.0         a  $1,500.00
1         2.0        3.0        4         3.0        -2  $2,436.45
2         3.0        2.0       64         4.0         3    $958.99
3         4.0        2.0       43         5.0         4  $1,798.00
4         5.0        3.0       34         NaN         3  $5,456.25

### and i will deal with the int_col to string column

In [16]:
# for object or str 
data['int_col']=data['int_col'].astype(str)        
data['int_col'][2]

'64'

In [17]:
# int object column to integer
data['int_col']=data['int_col'].astype(int)
data['int_col'][2]

64

### lets, deal with float column that containing missing value
 here rember that , a mising value dos,nt convert into the integer value<br>
 but if you want to convert than u can convert your mising value atribute to the float<br>
 if you need convert your mising value column in int than fill null value

In [12]:
data['mising_col']

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
Name: mising_col, dtype: float64

In [13]:
data['mising_col'].dtypes

dtype('float64')

In [18]:
data['mising_col']=data['mising_col'].astype(int,errors='ignore')
data['mising_col'].dtypes

# it will not change the dtypes but not gives the error

dtype('float64')

In [9]:
data.head()

  string_col  int_float  int_col  mising_col mixed_col      price
0          1          1        4         1.0         a  $1,500.00
1          2          3        4         3.0        -2  $2,436.45
2          3          2       64         4.0         3   $9,58.99
3          4          2       43         5.0         4  $1,798.00
4          5          3       34         NaN         3  $5,456.25

In [13]:
data['mising_col']=data['mising_col'].astype(int,errors='ignore')  #it is not possible bcz here mising value
data['mising_col'].dtypes
# but if you passed errors = ignore than it would not display the errar message
# but it does,nt dtype of column

dtype('float64')

In [8]:
data['mising_col']=pd.to_numeric(data.mising_col)
data.mising_col

#here result will be prsent in the float64 and nun value present also here
# if you want to change into int then remeber some point to keep in mind
# first "Int64" in string will have to parse and after the to_numeric
# bcz only one thid data typ can change the mising value present in float datatype

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
Name: mising_col, dtype: float64

### you have to choose the "int64" dtypes for the missing columns

In [9]:
data['mising_col'] = pd.to_numeric(data.mising_col).astype('Int64') 
data.mising_col
#this syntex is important for convert to mising value into Int64
data.mising_col

0       1
1       3
2       4
3       5
4    <NA>
Name: mising_col, dtype: Int64

In [22]:
pd.to_numeric(data['mising_col']).astype('Int64')   # there is i in capital

0       1
1       3
2       4
3       5
4    <NA>
Name: mising_col, dtype: Int64

### and we will remove the null value in the mising_col after that we will change the dattype in integer

In [20]:
data[-1:]
# you can see there is missing value present

  string_col  int_float  int_col  mising_col mixed_col      price
4          5        3.0       34        <NA>         3  $5,456.25

In [21]:
# To fill the missing value
data['mising_col']=data['mising_col'].fillna(0)

In [22]:
data
# we have filled out missing value

  string_col  int_float  int_col  mising_col mixed_col      price
0          1        1.0        4           1         a  $1,500.00
1          2        3.0        4           3        -2  $2,436.45
2          3        2.0       64           4         3   $9,58.99
3          4        2.2       43           5         4  $1,798.00
4          5        3.0       34           0         3  $5,456.25

### now, we will deal with mixed_col

In [29]:
data.mixed_col.dtypes

dtype('O')

### you can use  map function

In [26]:
data['mixed_col'].map(str)[3]     
#and now this is string datatype

'4'

In [28]:
dist={'a':'5'} 
def mapping_fun(x):
    if x=="a":
        return dist[x]
    else:
        return x

In [29]:
data['mixed_col']

0     a
1    -2
2     3
3     4
4     3
Name: mixed_col, dtype: object

In [30]:
data['mixed_col'].map(mapping_fun)

0     5
1    -2
2     3
3     4
4     3
Name: mixed_col, dtype: object

In [31]:
data.mixed_col.dtypes
#and this is object dtypes and we want into int

dtype('O')

### first we will goint to change in numeric bxz you can see all elements is numeric
but dtypes is Object because it contains many dtypes , so i can say this is object dtype.<br>
firs we take the to_numeric function and in this a parametere is very that is errors='coerce"<br>
this parameter when we will use ,i have numeric value dtypes of str <br>
hence, to_numeric function not change string value into integere ,so to_numeric function will be<br>
raise the error and if you want not to see error in your prograg than <br>
you should use errors parametere it will converet a numeric string into actual integer value thank you

In [35]:
data['mixed_col']=pd.to_numeric(data.mixed_col,errors="coerce").fillna(0).astype(int)
data
# astype() have no coerce parameter value astype() contains only two value errors and ignore
# but to_numeric() contains three parameter value both are same and as well as "coerce"  !

   string_col  int_float  int_col  mising_col  mixed_col      price
0         1.0        1.0        4           1          0  $1,500.00
1         2.0        3.0        4           3         -2  $2,436.45
2         3.0        2.0       64           4          3    $958.99
3         4.0        2.0       43           5          4  $1,798.00
4         5.0        3.0       34           0          3  $5,456.25

### this is my last object columns it contains str with numeric value
and i will deal with this column

In [39]:
data[['price']]

       price
0  $1,500.00
1  $2,436.45
2   $9,58.99
3  $1,798.00
4  $5,456.25

In [38]:
data[['price']].dtypes

price    object
dtype: object

In [39]:
data[['price']]

       price
0  $1,500.00
1  $2,436.45
2   $9,58.99
3  $1,798.00
4  $5,456.25

In [42]:
pd.to_numeric(data['price'])
# it show the error because element contain symbol
# and to_numeric function just only work on numeric

ValueError: Unable to parse string "$1,500.00" at position 0

In [34]:
pd.to_numeric(data['price'],errors='coerce')
# It is telling that i have all value of string value because they contain a string character
# hence to_numeric function convert into none value
# if you change the dtypes of this columns , rememeber that
# first you wil have to remove the " $ " symbol

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: price, dtype: float64

In [40]:
data['price']=data['price'].str.replace("$",'')
data['price'].dtypes

dtype('O')

In [41]:
data[['price']]
# now i has removed the $ symbol

      price
0  1,500.00
1  2,436.45
2   9,58.99
3  1,798.00
4  5,456.25

In [42]:
data[['price']].dtypes
# and now we can easily change the dtype

price    object
dtype: object

In [43]:
# replacing "$" and "," with empty space
data['price']=data['price'].str.replace('$','').str.replace(',','')
data['price']

0    1500.00
1    2436.45
2     958.99
3    1798.00
4    5456.25
Name: price, dtype: object

In [44]:
pd.to_numeric(data['price'],errors='coerce')

0    1500.00
1    2436.45
2     958.99
3    1798.00
4    5456.25
Name: price, dtype: float64

In [45]:
pd.to_numeric(data['price'],errors='coerce').dtypes

dtype('float64')

In [63]:
pd.to_numeric(data['price'],errors='coerce').astype(int).dtype

dtype('int32')

In [65]:
data['price']=pd.to_numeric(data['price'],errors='coerce').astype(int)

In [66]:
data.head()

  string_col  int_float  int_col  mising_col mixed_col  price
0          1          1        4           1         a   1500
1          2          3        4           3        -2   2436
2          3          2       64           4         3    958
3          4          2       43           5         4   1798
4          5          3       34        <NA>         3   5456

In [67]:
data.dtypes

string_col    object
int_float      int32
int_col        int64
mising_col     Int64
mixed_col     object
price          int32
dtype: object

### astype() with other syntex

In [69]:
new_data=data.astype({'string_col':'int32','int_float':'float','int_col':'float','price':'float'})
new_data,new_data.dtypes

(   string_col  int_float  int_col  mising_col mixed_col   price
 0           1        1.0      4.0           1         a  1500.0
 1           2        3.0      4.0           3        -2  2436.0
 2           3        2.0     64.0           4         3   958.0
 3           4        2.0     43.0           5         4  1798.0
 4           5        3.0     34.0        <NA>         3  5456.0,
 string_col      int32
 int_float     float64
 int_col       float64
 mising_col      Int64
 mixed_col      object
 price         float64
 dtype: object)

### Thank You